
## Plan Result

[CI link](https://github.com/hayas1/tfgh/actions/runs/11871416435)


<pre><code>Plan: 15 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.repositories[&#34;tokei-toukei&#34;].github_issue_label.this[&#34;breaking&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_issue_label.this[&#34;bugfix&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_issue_label.this[&#34;deps&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_issue_label.this[&#34;documentation&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_issue_label.this[&#34;feature&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_issue_label.this[&#34;maintenance&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_issue_label.this[&#34;refactor&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_repository_file.readme
  * module.repositories[&#34;tokei-toukei&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_repository_file.this[&#34;github/labeler.yml&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_repository_file.this[&#34;github/release.yml&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_repository_file.this[&#34;github/workflows/labeler.yml&#34;]
  * module.repositories[&#34;tokei-toukei&#34;].github_repository_pull_request.managed
  * module.repositories[&#34;tokei-toukei&#34;].github_repository_ruleset.this
* Update
  * module.repositories[&#34;tokei-toukei&#34;].github_repository.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.repositories["tokei-toukei"].github_issue_label.this["breaking"] will be created
  + resource "github_issue_label" "this" {
      + color       = "F84AD4"
      + description = "Containing breaking changes"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "breaking"
      + repository  = "tokei-toukei"
      + url         = (known after apply)
    }

  # module.repositories["tokei-toukei"].github_issue_label.this["bugfix"] will be created
  + resource "github_issue_label" "this" {
      + color       = "DE3659"
      + description = "Fix some bugs"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "bugfix"
      + repository  = "tokei-toukei"
      + url         = (known after apply)
    }

  # module.repositories["tokei-toukei"].github_issue_label.this["deps"] will be created
  + resource "github_issue_label" "this" {
      + color       = "36BF46"
      + description = "Dependency updates"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "deps"
      + repository  = "tokei-toukei"
      + url         = (known after apply)
    }

  # module.repositories["tokei-toukei"].github_issue_label.this["documentation"] will be created
  + resource "github_issue_label" "this" {
      + color       = "0075CA"
      + description = "Documentation"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "documentation"
      + repository  = "tokei-toukei"
      + url         = (known after apply)
    }

  # module.repositories["tokei-toukei"].github_issue_label.this["feature"] will be created
  + resource "github_issue_label" "this" {
      + color       = "008B75"
      + description = "New feature"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "feature"
      + repository  = "tokei-toukei"
      + url         = (known after apply)
    }

  # module.repositories["tokei-toukei"].github_issue_label.this["maintenance"] will be created
  + resource "github_issue_label" "this" {
      + color       = "7F6054"
      + description = "No effect on codebase"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "maintenance"
      + repository  = "tokei-toukei"
      + url         = (known after apply)
    }

  # module.repositories["tokei-toukei"].github_issue_label.this["refactor"] will be created
  + resource "github_issue_label" "this" {
      + color       = "BA5798"
      + description = "Refactoring"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "refactor"
      + repository  = "tokei-toukei"
      + url         = (known after apply)
    }

  # module.repositories["tokei-toukei"].github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      ~ auto_init                   = false -> true
      ~ delete_branch_on_merge      = false -> true
      - has_downloads               = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "tokei-toukei"
        name                        = "tokei-toukei"
      - vulnerability_alerts        = true -> null
        # (30 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: README.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # tokei-toukei
            tokei LoC on browser
        EOT
      + file                            = "README.md"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "tokei-toukei"
      + sha                             = (known after apply)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Expectation :butterfly:
            > What behavior is expected?
            
            # Reality :bug:
            > How does it actually work?
            
            # Environment :evergreen_tree:
            > (When and) Where the behavior was observed?
            
            # Cause :mag:
            > Why this issue was occurred?
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
      + file                         = ".github/issue_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "tokei-toukei"
      + sha                          = (known after apply)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/labeler.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
      + file                         = ".github/labeler.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "tokei-toukei"
      + sha                          = (known after apply)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/pull_request_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Overview :rocket:
            > What is this pull request?
            
            # Implementation :clamp:
            > How to realize ?
            
            # Use cases :chopsticks:
            > Why this pull request was created?
            
            # Testing :gear:
            > Testing steps
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
      + file                         = ".github/pull_request_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "tokei-toukei"
      + sha                          = (known after apply)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/release.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/release.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            changelog:
              categories:
                - title: '🚀 Features'
                  labels:
                    - feature
                - title: '🔨 Breaking Changes'
                  labels:
                    - breaking
                - title: '🐛 Bug Fixes'
                  labels:
                    - bugfix
                - title: '🔧 Refactoring'
                  labels:
                    - refactor
                - title: '📖 Documentation'
                  labels:
                    - documentation
                - title: '👒 Dependency update'
                  labels:
                    - deps
                - title: '🧰 Maintenance'
                  labels:
                    - maintenance
                - title: Other Changes
                  labels:
                    - "*"
        EOT
      + file                         = ".github/release.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "tokei-toukei"
      + sha                          = (known after apply)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/workflows/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/workflows/labeler.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
      + file                         = ".github/workflows/labeler.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "tokei-toukei"
      + sha                          = (known after apply)
    }

  # module.repositories["tokei-toukei"].github_repository_pull_request.managed will be created
  + resource "github_repository_pull_request" "managed" {
      + base_ref              = "master"
      + base_repository       = "tokei-toukei"
      + base_sha              = (known after apply)
      + body                  = <<-EOT
            - .github/issue_template.md
            - .github/labeler.yml
            - .github/pull_request_template.md
            - .github/release.yml
            - .github/workflows/labeler.yml
        EOT
      + draft                 = (known after apply)
      + head_ref              = "chore/managed-by-terraform"
      + head_sha              = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + maintainer_can_modify = false
      + number                = (known after apply)
      + opened_at             = (known after apply)
      + opened_by             = (known after apply)
      + state                 = (known after apply)
      + title                 = "[auto] snippet files managed by Terraform"
      + updated_at            = (known after apply)
    }

  # module.repositories["tokei-toukei"].github_repository_ruleset.this will be created
  + resource "github_repository_ruleset" "this" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "default"
      + node_id     = (known after apply)
      + repository  = "tokei-toukei"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 5
          + actor_type  = "RepositoryRole"
          + bypass_mode = "pull_request"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + non_fast_forward              = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 0
              + required_review_thread_resolution = false
            }
        }
    }

Plan: 15 to add, 1 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["devcontainer-features"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"ef35fb36f8f9abe2033aa38e3c3694802df3e9ef337437623fd50f27b66030aa\"" -> "W/\"cd328e3a4fabb6f4be6839082e57ccd590781b1ee7a757ee752ec562019c1136\""
        id                          = "devcontainer-features"
        name                        = "devcontainer-features"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"00d389b8b72c8f1c9f524184862295da99a976413f956ac10edeb7140381eaae\"" -> "W/\"691a14dc166e4bb806d925b980348b8b7d06c64721567a3916e4eb97ddcd80d9\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["json-with-comments"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"aaa7771d1ff3b01c54013ccdae3c31f76dbd5765ffeb72db31ff4e3593080459\"" -> "W/\"0784645828cde6d0f1c295be52bba8e605a31db21399773426a5309b597d618e\""
        id                          = "json-with-comments"
        name                        = "json-with-comments"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"ca7f92f76a31615fe16f6bcfc4eae4a80986b93f653d16a7b9b930acf610b17a\"" -> "W/\"bad6c4cdba6ef491c377258da757426213c51df904582a3e22ad29ffcc44ea86\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["tokei-toukei"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"091b31cc6090b7cda1a27917158599fb3d42e586835c98b3899cbb1d584d4aa6\"" -> "W/\"572b4029aaa7f524f1dbe54c62fac762c5273e555e5312e09c45a1944728aad3\""
        id                          = "tokei-toukei"
        name                        = "tokei-toukei"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":71,"Program":"tfcmt","SHA1":"f1fc81119726d189e1fb508a225c73cf9032a1d8","Vars":{},"WorkflowName":"Terraform plan on pull request"} -->